package main

//	package - упаковка, пакет
//	import - импортирование
//	func - функция
//	var - переменная
//	const - не изменяемая переменная
//	true - правда
//	false - ложь
//	iota - последовательные целочисленные константы 0, 1, 2,…
//	int - тип числовой
//	int8 - представляет целое число от -128 до 127 и занимает в памяти 1 байт (8 бит)
//	int16 - представляет целое число от -32768 до 32767 и занимает в памяти 2 байта (16 бит)
//	int32 - представляет целое число от -2147483648 до 2147483647 и занимает 4 байта (32 бита)
//	int64 - представляет целое число от –9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 и занимает 8 байт (64 бита)
//	uint - представляет целое беззнаковое число
//	uint8 - представляет целое число от 0 до 255 и занимает 1 байт
//	uint16 - представляет целое число от 0 до 65535 и занимает 2 байта
//	uint32 - представляет целое число от 0 до 4294967295 и занимает 4 байта
//	uint64 - представляет целое число от 0 до 18 446 744 073 709 551 615 и занимает 8 байт
//	float32 - типа данных для чисел с плавающей запятой занимает 4 байта
//	float64 - типа данных для чисел с плавающей запятой занимает 8 байт
//	complex128 - набор всех комплексных чисел с действительными и мнимыми частями float64.
//	complex64 - набор всех комплексных чисел с действительными и мнимыми частями float32.
//	bool - Логический тип данных
//	byte - синоним типа uint8, представляет целое число от 0 до 255 и занимает 1 байт, 
//	rune - синоним типа int32, представляет целое число от -2147483648 до 2147483647 и занимает 4 байта, "кодовая точка" ("code point") для обозначения элемента
//	string - это последовательность из одного или нескольких символов, составляются из символов Unicode и являются неизменяемыми последовательностями
//	complex - Комплексное число
//	real - встроенная функция, которая извлекает действительную часть заданного комплексного числа
//	imag - встроенная функция, которая извлекает мнимую часть заданного комплексного числа
//	len - Используйте встроенную функцию len для получения длины строки. Len поддерживает массивы, срезы и карты.